{"modelTopology": null, "weightsManifest": [{"paths": ["group1-shard1of1"], "weights": [{"name": "conv1/kernel", "shape": [3, 3, 3, 8], "dtype": "float32"}]}, {"paths": ["group2-shard1of1"], "weights": [{"name": "conv1_bn/gamma", "shape": [8], "dtype": "float32"}, {"name": "conv1_bn/beta", "shape": [8], "dtype": "float32"}, {"name": "conv1_bn/moving_mean", "shape": [8], "dtype": "float32"}, {"name": "conv1_bn/moving_variance", "shape": [8], "dtype": "float32"}]}, {"paths": ["group3-shard1of1"], "weights": [{"name": "conv_dw_1/depthwise_kernel", "shape": [3, 3, 8, 1], "dtype": "float32"}]}, {"paths": ["group4-shard1of1"], "weights": [{"name": "conv_dw_1_bn/gamma", "shape": [8], "dtype": "float32"}, {"name": "conv_dw_1_bn/beta", "shape": [8], "dtype": "float32"}, {"name": "conv_dw_1_bn/moving_mean", "shape": [8], "dtype": "float32"}, {"name": "conv_dw_1_bn/moving_variance", "shape": [8], "dtype": "float32"}]}, {"paths": ["group5-shard1of1"], "weights": [{"name": "conv_pw_1/kernel", "shape": [1, 1, 8, 16], "dtype": "float32"}]}, {"paths": ["group6-shard1of1"], "weights": [{"name": "conv_pw_1_bn/gamma", "shape": [16], "dtype": "float32"}, {"name": "conv_pw_1_bn/beta", "shape": [16], "dtype": "float32"}, {"name": "conv_pw_1_bn/moving_mean", "shape": [16], "dtype": "float32"}, {"name": "conv_pw_1_bn/moving_variance", "shape": [16], "dtype": "float32"}]}, {"paths": ["group7-shard1of1"], "weights": [{"name": "conv_dw_2/depthwise_kernel", "shape": [3, 3, 16, 1], "dtype": "float32"}]}, {"paths": ["group8-shard1of1"], "weights": [{"name": "conv_dw_2_bn/gamma", "shape": [16], "dtype": "float32"}, {"name": "conv_dw_2_bn/beta", "shape": [16], "dtype": "float32"}, {"name": "conv_dw_2_bn/moving_mean", "shape": [16], "dtype": "float32"}, {"name": "conv_dw_2_bn/moving_variance", "shape": [16], "dtype": "float32"}]}, {"paths": ["group9-shard1of1"], "weights": [{"name": "conv_pw_2/kernel", "shape": [1, 1, 16, 32], "dtype": "float32"}]}, {"paths": ["group10-shard1of1"], "weights": [{"name": "conv_pw_2_bn/gamma", "shape": [32], "dtype": "float32"}, {"name": "conv_pw_2_bn/beta", "shape": [32], "dtype": "float32"}, {"name": "conv_pw_2_bn/moving_mean", "shape": [32], "dtype": "float32"}, {"name": "conv_pw_2_bn/moving_variance", "shape": [32], "dtype": "float32"}]}, {"paths": ["group11-shard1of1"], "weights": [{"name": "conv_dw_3/depthwise_kernel", "shape": [3, 3, 32, 1], "dtype": "float32"}]}, {"paths": ["group12-shard1of1"], "weights": [{"name": "conv_dw_3_bn/gamma", "shape": [32], "dtype": "float32"}, {"name": "conv_dw_3_bn/beta", "shape": [32], "dtype": "float32"}, {"name": "conv_dw_3_bn/moving_mean", "shape": [32], "dtype": "float32"}, {"name": "conv_dw_3_bn/moving_variance", "shape": [32], "dtype": "float32"}]}, {"paths": ["group13-shard1of1"], "weights": [{"name": "conv_pw_3/kernel", "shape": [1, 1, 32, 32], "dtype": "float32"}]}, {"paths": ["group14-shard1of1"], "weights": [{"name": "conv_pw_3_bn/gamma", "shape": [32], "dtype": "float32"}, {"name": "conv_pw_3_bn/beta", "shape": [32], "dtype": "float32"}, {"name": "conv_pw_3_bn/moving_mean", "shape": [32], "dtype": "float32"}, {"name": "conv_pw_3_bn/moving_variance", "shape": [32], "dtype": "float32"}]}, {"paths": ["group15-shard1of1"], "weights": [{"name": "conv_dw_4/depthwise_kernel", "shape": [3, 3, 32, 1], "dtype": "float32"}]}, {"paths": ["group16-shard1of1"], "weights": [{"name": "conv_dw_4_bn/gamma", "shape": [32], "dtype": "float32"}, {"name": "conv_dw_4_bn/beta", "shape": [32], "dtype": "float32"}, {"name": "conv_dw_4_bn/moving_mean", "shape": [32], "dtype": "float32"}, {"name": "conv_dw_4_bn/moving_variance", "shape": [32], "dtype": "float32"}]}, {"paths": ["group17-shard1of1"], "weights": [{"name": "conv_pw_4/kernel", "shape": [1, 1, 32, 64], "dtype": "float32"}]}, {"paths": ["group18-shard1of1"], "weights": [{"name": "conv_pw_4_bn/gamma", "shape": [64], "dtype": "float32"}, {"name": "conv_pw_4_bn/beta", "shape": [64], "dtype": "float32"}, {"name": "conv_pw_4_bn/moving_mean", "shape": [64], "dtype": "float32"}, {"name": "conv_pw_4_bn/moving_variance", "shape": [64], "dtype": "float32"}]}, {"paths": ["group19-shard1of1"], "weights": [{"name": "conv_dw_5/depthwise_kernel", "shape": [3, 3, 64, 1], "dtype": "float32"}]}, {"paths": ["group20-shard1of1"], "weights": [{"name": "conv_dw_5_bn/gamma", "shape": [64], "dtype": "float32"}, {"name": "conv_dw_5_bn/beta", "shape": [64], "dtype": "float32"}, {"name": "conv_dw_5_bn/moving_mean", "shape": [64], "dtype": "float32"}, {"name": "conv_dw_5_bn/moving_variance", "shape": [64], "dtype": "float32"}]}, {"paths": ["group21-shard1of1"], "weights": [{"name": "conv_pw_5/kernel", "shape": [1, 1, 64, 64], "dtype": "float32"}]}, {"paths": ["group22-shard1of1"], "weights": [{"name": "conv_pw_5_bn/gamma", "shape": [64], "dtype": "float32"}, {"name": "conv_pw_5_bn/beta", "shape": [64], "dtype": "float32"}, {"name": "conv_pw_5_bn/moving_mean", "shape": [64], "dtype": "float32"}, {"name": "conv_pw_5_bn/moving_variance", "shape": [64], "dtype": "float32"}]}, {"paths": ["group23-shard1of1"], "weights": [{"name": "conv_dw_6/depthwise_kernel", "shape": [3, 3, 64, 1], "dtype": "float32"}]}, {"paths": ["group24-shard1of1"], "weights": [{"name": "conv_dw_6_bn/gamma", "shape": [64], "dtype": "float32"}, {"name": "conv_dw_6_bn/beta", "shape": [64], "dtype": "float32"}, {"name": "conv_dw_6_bn/moving_mean", "shape": [64], "dtype": "float32"}, {"name": "conv_dw_6_bn/moving_variance", "shape": [64], "dtype": "float32"}]}, {"paths": ["group25-shard1of1"], "weights": [{"name": "conv_pw_6/kernel", "shape": [1, 1, 64, 128], "dtype": "float32"}]}, {"paths": ["group26-shard1of1"], "weights": [{"name": "conv_pw_6_bn/gamma", "shape": [128], "dtype": "float32"}, {"name": "conv_pw_6_bn/beta", "shape": [128], "dtype": "float32"}, {"name": "conv_pw_6_bn/moving_mean", "shape": [128], "dtype": "float32"}, {"name": "conv_pw_6_bn/moving_variance", "shape": [128], "dtype": "float32"}]}, {"paths": ["group27-shard1of1"], "weights": [{"name": "conv_dw_7/depthwise_kernel", "shape": [3, 3, 128, 1], "dtype": "float32"}]}, {"paths": ["group28-shard1of1"], "weights": [{"name": "conv_dw_7_bn/gamma", "shape": [128], "dtype": "float32"}, {"name": "conv_dw_7_bn/beta", "shape": [128], "dtype": "float32"}, {"name": "conv_dw_7_bn/moving_mean", "shape": [128], "dtype": "float32"}, {"name": "conv_dw_7_bn/moving_variance", "shape": [128], "dtype": "float32"}]}, {"paths": ["group29-shard1of1"], "weights": [{"name": "conv_pw_7/kernel", "shape": [1, 1, 128, 128], "dtype": "float32"}]}, {"paths": ["group30-shard1of1"], "weights": [{"name": "conv_pw_7_bn/gamma", "shape": [128], "dtype": "float32"}, {"name": "conv_pw_7_bn/beta", "shape": [128], "dtype": "float32"}, {"name": "conv_pw_7_bn/moving_mean", "shape": [128], "dtype": "float32"}, {"name": "conv_pw_7_bn/moving_variance", "shape": [128], "dtype": "float32"}]}, {"paths": ["group31-shard1of1"], "weights": [{"name": "conv_dw_8/depthwise_kernel", "shape": [3, 3, 128, 1], "dtype": "float32"}]}, {"paths": ["group32-shard1of1"], "weights": [{"name": "conv_dw_8_bn/gamma", "shape": [128], "dtype": "float32"}, {"name": "conv_dw_8_bn/beta", "shape": [128], "dtype": "float32"}, {"name": "conv_dw_8_bn/moving_mean", "shape": [128], "dtype": "float32"}, {"name": "conv_dw_8_bn/moving_variance", "shape": [128], "dtype": "float32"}]}, {"paths": ["group33-shard1of1"], "weights": [{"name": "conv_pw_8/kernel", "shape": [1, 1, 128, 128], "dtype": "float32"}]}, {"paths": ["group34-shard1of1"], "weights": [{"name": "conv_pw_8_bn/gamma", "shape": [128], "dtype": "float32"}, {"name": "conv_pw_8_bn/beta", "shape": [128], "dtype": "float32"}, {"name": "conv_pw_8_bn/moving_mean", "shape": [128], "dtype": "float32"}, {"name": "conv_pw_8_bn/moving_variance", "shape": [128], "dtype": "float32"}]}, {"paths": ["group35-shard1of1"], "weights": [{"name": "conv_dw_9/depthwise_kernel", "shape": [3, 3, 128, 1], "dtype": "float32"}]}, {"paths": ["group36-shard1of1"], "weights": [{"name": "conv_dw_9_bn/gamma", "shape": [128], "dtype": "float32"}, {"name": "conv_dw_9_bn/beta", "shape": [128], "dtype": "float32"}, {"name": "conv_dw_9_bn/moving_mean", "shape": [128], "dtype": "float32"}, {"name": "conv_dw_9_bn/moving_variance", "shape": [128], "dtype": "float32"}]}, {"paths": ["group37-shard1of1"], "weights": [{"name": "conv_pw_9/kernel", "shape": [1, 1, 128, 128], "dtype": "float32"}]}, {"paths": ["group38-shard1of1"], "weights": [{"name": "conv_pw_9_bn/gamma", "shape": [128], "dtype": "float32"}, {"name": "conv_pw_9_bn/beta", "shape": [128], "dtype": "float32"}, {"name": "conv_pw_9_bn/moving_mean", "shape": [128], "dtype": "float32"}, {"name": "conv_pw_9_bn/moving_variance", "shape": [128], "dtype": "float32"}]}, {"paths": ["group39-shard1of1"], "weights": [{"name": "conv_dw_10/depthwise_kernel", "shape": [3, 3, 128, 1], "dtype": "float32"}]}, {"paths": ["group40-shard1of1"], "weights": [{"name": "conv_dw_10_bn/gamma", "shape": [128], "dtype": "float32"}, {"name": "conv_dw_10_bn/beta", "shape": [128], "dtype": "float32"}, {"name": "conv_dw_10_bn/moving_mean", "shape": [128], "dtype": "float32"}, {"name": "conv_dw_10_bn/moving_variance", "shape": [128], "dtype": "float32"}]}, {"paths": ["group41-shard1of1"], "weights": [{"name": "conv_pw_10/kernel", "shape": [1, 1, 128, 128], "dtype": "float32"}]}, {"paths": ["group42-shard1of1"], "weights": [{"name": "conv_pw_10_bn/gamma", "shape": [128], "dtype": "float32"}, {"name": "conv_pw_10_bn/beta", "shape": [128], "dtype": "float32"}, {"name": "conv_pw_10_bn/moving_mean", "shape": [128], "dtype": "float32"}, {"name": "conv_pw_10_bn/moving_variance", "shape": [128], "dtype": "float32"}]}, {"paths": ["group43-shard1of1"], "weights": [{"name": "conv_dw_11/depthwise_kernel", "shape": [3, 3, 128, 1], "dtype": "float32"}]}, {"paths": ["group44-shard1of1"], "weights": [{"name": "conv_dw_11_bn/gamma", "shape": [128], "dtype": "float32"}, {"name": "conv_dw_11_bn/beta", "shape": [128], "dtype": "float32"}, {"name": "conv_dw_11_bn/moving_mean", "shape": [128], "dtype": "float32"}, {"name": "conv_dw_11_bn/moving_variance", "shape": [128], "dtype": "float32"}]}, {"paths": ["group45-shard1of1"], "weights": [{"name": "conv_pw_11/kernel", "shape": [1, 1, 128, 128], "dtype": "float32"}]}, {"paths": ["group46-shard1of1"], "weights": [{"name": "conv_pw_11_bn/gamma", "shape": [128], "dtype": "float32"}, {"name": "conv_pw_11_bn/beta", "shape": [128], "dtype": "float32"}, {"name": "conv_pw_11_bn/moving_mean", "shape": [128], "dtype": "float32"}, {"name": "conv_pw_11_bn/moving_variance", "shape": [128], "dtype": "float32"}]}, {"paths": ["group47-shard1of1"], "weights": [{"name": "conv_dw_12/depthwise_kernel", "shape": [3, 3, 128, 1], "dtype": "float32"}]}, {"paths": ["group48-shard1of1"], "weights": [{"name": "conv_dw_12_bn/gamma", "shape": [128], "dtype": "float32"}, {"name": "conv_dw_12_bn/beta", "shape": [128], "dtype": "float32"}, {"name": "conv_dw_12_bn/moving_mean", "shape": [128], "dtype": "float32"}, {"name": "conv_dw_12_bn/moving_variance", "shape": [128], "dtype": "float32"}]}, {"paths": ["group49-shard1of1"], "weights": [{"name": "conv_pw_12/kernel", "shape": [1, 1, 128, 256], "dtype": "float32"}]}, {"paths": ["group50-shard1of1"], "weights": [{"name": "conv_pw_12_bn/gamma", "shape": [256], "dtype": "float32"}, {"name": "conv_pw_12_bn/beta", "shape": [256], "dtype": "float32"}, {"name": "conv_pw_12_bn/moving_mean", "shape": [256], "dtype": "float32"}, {"name": "conv_pw_12_bn/moving_variance", "shape": [256], "dtype": "float32"}]}, {"paths": ["group51-shard1of1"], "weights": [{"name": "conv_dw_13/depthwise_kernel", "shape": [3, 3, 256, 1], "dtype": "float32"}]}, {"paths": ["group52-shard1of1"], "weights": [{"name": "conv_dw_13_bn/gamma", "shape": [256], "dtype": "float32"}, {"name": "conv_dw_13_bn/beta", "shape": [256], "dtype": "float32"}, {"name": "conv_dw_13_bn/moving_mean", "shape": [256], "dtype": "float32"}, {"name": "conv_dw_13_bn/moving_variance", "shape": [256], "dtype": "float32"}]}, {"paths": ["group53-shard1of1"], "weights": [{"name": "conv_pw_13/kernel", "shape": [1, 1, 256, 256], "dtype": "float32"}]}, {"paths": ["group54-shard1of1"], "weights": [{"name": "conv_pw_13_bn/gamma", "shape": [256], "dtype": "float32"}, {"name": "conv_pw_13_bn/beta", "shape": [256], "dtype": "float32"}, {"name": "conv_pw_13_bn/moving_mean", "shape": [256], "dtype": "float32"}, {"name": "conv_pw_13_bn/moving_variance", "shape": [256], "dtype": "float32"}]}, {"paths": ["group55-shard1of1"], "weights": [{"name": "conv_preds/kernel", "shape": [1, 1, 256, 1000], "dtype": "float32"}, {"name": "conv_preds/bias", "shape": [1000], "dtype": "float32"}]}]}